SoCXin/STM32G030/project/IAP/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g0xx_hal.h"

#include "stm32g0xx_ll_iwdg.h"
#include "stm32g0xx_ll_rcc.h"
#include "stm32g0xx_ll_bus.h"
#include "stm32g0xx_ll_system.h"
#include "stm32g0xx_ll_exti.h"
#include "stm32g0xx_ll_cortex.h"
#include "stm32g0xx_ll_utils.h"
#include "stm32g0xx_ll_pwr.h"
#include "stm32g0xx_ll_dma.h"
#include "stm32g0xx_ll_rtc.h"
#include "stm32g0xx_ll_usart.h"
#include "stm32g0xx_ll_gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
//extern IWDG_HandleTypeDef hiwdg;
//extern UART_HandleTypeDef huart1;
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED3_Pin LL_GPIO_PIN_3
#define LED3_GPIO_Port GPIOA
#define LED2_Pin LL_GPIO_PIN_4
#define LED2_GPIO_Port GPIOA
#define LED1_Pin LL_GPIO_PIN_5
#define LED1_GPIO_Port GPIOA
#define AUTO_Pin LL_GPIO_PIN_6
#define AUTO_GPIO_Port GPIOA
#define HALL1_Pin LL_GPIO_PIN_7
#define HALL1_GPIO_Port GPIOA
#define HALL2_Pin LL_GPIO_PIN_0
#define HALL2_GPIO_Port GPIOB
#define HALL3_Pin LL_GPIO_PIN_1
#define HALL3_GPIO_Port GPIOB
#define SD_Pin LL_GPIO_PIN_15
#define SD_GPIO_Port GPIOB
#define RS485_EN_Pin LL_GPIO_PIN_8
#define RS485_EN_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */
// extern IWDG_HandleTypeDef hiwdg;
#define   feed_dog()         LL_IWDG_ReloadCounter(IWDG) //LL_mDelay(0)  //HAL_IWDG_Refresh(&hiwdg) //
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
